Lzw655/esp-bsp/bsp/esp32_p4_function_ev_board/src/mipi_soc/include/gdma_struct.h
                uint32_t ch_suspended                  :    1;
                uint32_t ch_disabled                   :    1;
                uint32_t ch_aborted                    :    1;
            };
            uint32_t val;
        } int_sig_ena0;
        union {
            struct {
                uint32_t ecc_prot_chmem_correrr        :    1;
                uint32_t ecc_prot_chmem_uncorrerr      :    1;
                uint32_t ecc_prot_uidmem_correrr       :    1;
                uint32_t ecc_prot_uidmem_uncorrerr     :    1;
                uint32_t reserved4                     :    28;
            };
            uint32_t val;
        } int_sig_ena1;
        union {
            struct {
                uint32_t block_tfr_done                :    1;
                uint32_t dma_tfr_done                  :    1;
                uint32_t reserved2                     :    1;
                uint32_t src_transcomp                 :    1;
                uint32_t dst_transcomp                 :    1;
                uint32_t src_dec_err                   :    1;
                uint32_t dst_dec_err                   :    1;
                uint32_t src_slv_err                   :    1;
                uint32_t dst_slv_err                   :    1;
                uint32_t lli_rd_dec_err                :    1;
                uint32_t lli_wr_dec_err                :    1;
                uint32_t lli_rd_slv_err                :    1;
                uint32_t lli_wr_slv_err                :    1;
                uint32_t shadowreg_or_lli_invalid_err  :    1;
                uint32_t slvif_multiblktype_err        :    1;
                uint32_t reserved15                    :    1;
                uint32_t slvif_dec_err                 :    1;
                uint32_t slvif_wr2ro_err               :    1;
                uint32_t slvif_rd2rwo_err              :    1;
                uint32_t slvif_wronchen_err            :    1;
                uint32_t slvif_shadowreg_wron_valid_err:    1;
                uint32_t slvif_wronhold_err            :    1;
                uint32_t reserved22to24                :    3;
                uint32_t slvif_wrparity_err            :    1;
                uint32_t reserved26                    :    1;
                uint32_t ch_lock_cleared               :    1;
                uint32_t ch_src_suspended              :    1;
                uint32_t ch_suspended                  :    1;
                uint32_t ch_disabled                   :    1;
                uint32_t ch_aborted                    :    1;
            };
            uint32_t val;
        } int_clr0;
        union {
            struct {
                uint32_t ecc_prot_chmem_correrr        :    1;
                uint32_t ecc_prot_chmem_uncorrerr      :    1;
                uint32_t ecc_prot_uidmem_correrr       :    1;
                uint32_t ecc_prot_uidmem_uncorrerr     :    1;
                uint32_t reserved4                     :    28;
            };
            uint32_t val;
        } int_clr1;
        uint32_t reserved_1a0;
        uint32_t reserved_1a4;
        uint32_t reserved_1a8;
        uint32_t reserved_1ac;
        uint32_t reserved_1b0;
        uint32_t reserved_1b4;
        uint32_t reserved_1b8;
        uint32_t reserved_1bc;
        uint32_t reserved_1c0;
        uint32_t reserved_1c4;
        uint32_t reserved_1c8;
        uint32_t reserved_1cc;
        uint32_t reserved_1d0;
        uint32_t reserved_1d4;
        uint32_t reserved_1d8;
        uint32_t reserved_1dc;
        uint32_t reserved_1e0;
        uint32_t reserved_1e4;
        uint32_t reserved_1e8;
        uint32_t reserved_1ec;
        uint32_t reserved_1f0;
        uint32_t reserved_1f4;
        uint32_t reserved_1f8;
        uint32_t reserved_1fc;
    } ch[4];
} gdma_dev_t;
extern gdma_dev_t DW_GDMA;

#ifdef __cplusplus
}
#endif



#endif /*_SOC_GDMA_STRUCT_H_ */
